# 4. Написать программу, которая генерирует в указанных пользователем границах:
# ● случайное целое число,
# ● случайное вещественное число,
# ● случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона.
# Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
# Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.

import random


int1 = int(input('Введите нижнюю границу случайного целого числа: '))
int2 = int(input('Введите верхнюю границу случайного целого числа: '))
fl1 = float(input('Введите нижнюю границу случайного вещественного числа: '))
fl2 = float(input('Введите верхнюю границу случайного вещественного числа: '))
ch1 = input('Введите нижнюю границу случайного символа: ').lower()
ch2 = input('Введите верхнюю границу случайного символа: ').lower()

rand_int = random.randint(int1, int2)
rand_fl = random.random() * (fl2 - fl1) + fl1
rand_ch = chr(random.randint(ord(ch1), ord(ch2)))

print(f'Случайное целое число: {rand_int}\n'
      f'Случайное вещественное число: {rand_fl}\n'
      f'Случайный символ: {rand_ch}')
