# 1. Написать программу, которая будет складывать, вычитать, умножать или делить два числа.
# Числа и знак операции вводятся пользователем.
# После выполнения вычисления программа не завершается, а запрашивает новые данные для вычислений.
# Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.
# Если пользователь вводит неверный знак (не '0', '+', '-', '*', '/'),
# программа должна сообщать об ошибке и снова запрашивать знак операции.
# Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел его в качестве делителя.


n1 = int(input('Введите первое число: '))
n2 = int(input('Введите второе число: '))
s = input('Введите знак операции: ')

while s != '0':
      if s == '+':
            calc = n1 + n2
      elif s == '-':
            calc = n1 - n2
      elif s == '*':
            calc = n1 * n2
      elif s == '/':
            if n2 != 0:
                  calc = n1 / n2
            else:
                  print('На ноль делить нельзя!')
      else:
            s = input('Неверный знак операции. Введите знак операции: ')
      print(f'Ответ {calc}.')

      n1 = int(input('Введите первое число: '))
      n2 = int(input('Введите второе число: '))
      s = input('Введите знак операции: ')
